In [ ]:
# TOPIC : Quering DATA 
# Different use-cases of SELECT command statement for Quering data

In [22]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\admin\anaconda3\lib\site-packages (8.3.0)Note: you may need to restart the kernel to use updated packages.

In [23]:
import mysql.connector as d

In [24]:
from tabulate import tabulate

In [25]:
mydb = d.connect(host = 'localhost',user = 'root',passwd = 'Loveumom@123')

In [26]:
cursor = mydb.cursor()

In [27]:
cursor.execute("SHOW DATABASES")    # TO SEE AVAILABLE DATABASES
cursor.fetchall()

[('cardataset',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sidfirst',),
 ('sqlpractice1',),
 ('sys',)]

In [28]:
cursor.execute('USE sidfirst')     # TO SEE AVAILABLE TABLES IN PERTICULAR DATABASE
cursor.execute('SHOW TABLES')
cursor.fetchall()

[('glassdata',), ('ineuron',), ('sid1',), ('workers',)]

In [11]:
# CREATING A NEW TABLE CALLED WORKERS
cursor.execute("CREATE TABLE sidfirst.workers(Id TINYINT PRIMARY KEY, Name VARCHAR(150), Position VARCHAR(50), Salary SMALLINT, Hire_Date DATE)")

In [12]:
# NOW CHECK IF ABOVE TABLE IS CREATED : YES IT IS :)#

cursor.execute('USE sidfirst')     
cursor.execute('SHOW TABLES')
cursor.fetchall()

[('glassdata',), ('ineuron',), ('sid1',), ('workers',)]

In [17]:
# INSERTING DATA INTO WORKERS TABLE # BY JUST ADDING VALUES AS WE KNOW COLUMNS #

query = "INSERT INTO sidfirst.workers VALUES (1,'Alice','Junior',2000,'2020-04-23'),(2,'bob','Junior',3000,'2019-05-19'),(3,'charlie','Senior',6000,'2000-01-12'),(4,'diana','Senior',7000,'2000-02-14'),(5,'Harvey','Manager',16000,'1995-05-20')"
cursor.execute(query)

In [18]:
mydb.commit()

In [29]:
cursor.execute("SELECT * FROM sidfirst.workers")
results = cursor.fetchall()
columns = [column[0] for column in cursor.description]
print(tabulate(results, headers=columns, tablefmt = 'pretty'))

+----+---------+----------+--------+------------+
| Id |  Name   | Position | Salary | Hire_Date  |
+----+---------+----------+--------+------------+
| 1  |  Alice  |  Junior  |  2000  | 2020-04-23 |
| 2  |   bob   |  Junior  |  3000  | 2019-05-19 |
| 3  | charlie |  Senior  |  6000  | 2000-01-12 |
| 4  |  diana  |  Senior  |  7000  | 2000-02-14 |
| 5  | Harvey  | Manager  | 16000  | 1995-05-20 |
+----+---------+----------+--------+------------+

In [ ]:
# 1. LITERAL VALUE.. any string or number

In [30]:
cursor.execute("SELECT Name, 'worker' AS role FROM sidfirst.workers")

In [31]:
 # note: even here we say fetchall but it will give ouput of only 2 rows because in select statement we selected only 2 columns
results = cursor.fetchall()
columns = [column[0] for column in cursor.description]
print(tabulate(results,headers = columns,tablefmt = 'pretty'))

+---------+--------+
|  Name   |  role  |
+---------+--------+
|  Alice  | worker |
|   bob   | worker |
| charlie | worker |
|  diana  | worker |
| Harvey  | worker |
+---------+--------+

In [38]:
# 2. EXPRESSION : INCREASING EACH WORKER'S SALARY BY 10%
cursor.execute("SELECT Name,Salary,Salary*1.10 AS Increased_Salary FROM sidfirst.workers")

In [39]:
results = cursor.fetchall()
columns = [column[0] for column in cursor.description]
print(tabulate(results,headers = columns,tablefmt = 'pretty'))

+---------+--------+------------------+
|  Name   | Salary | Increased_Salary |
+---------+--------+------------------+
|  Alice  |  2000  |     2200.00      |
|   bob   |  3000  |     3300.00      |
| charlie |  6000  |     6600.00      |
|  diana  |  7000  |     7700.00      |
| Harvey  | 16000  |     17600.00     |
+---------+--------+------------------+

In [40]:
# 3. FUNCTION : EXTRACTING YEAR FROM HIRE_DATE
cursor.execute("SELECT Name,Hire_Date,YEAR(Hire_Date) AS Hire_Year FROM sidfirst.workers")

In [41]:
results = cursor.fetchall()
columns = [column[0] for column in cursor.description]
print(tabulate(results,headers = columns,tablefmt = 'pretty'))

+---------+------------+-----------+
|  Name   | Hire_Date  | Hire_Year |
+---------+------------+-----------+
|  Alice  | 2020-04-23 |   2020    |
|   bob   | 2019-05-19 |   2019    |
| charlie | 2000-01-12 |   2000    |
|  diana  | 2000-02-14 |   2000    |
| Harvey  | 1995-05-20 |   1995    |
+---------+------------+-----------+

In [ ]:
# 4. FUNCTION : COUNTING NUMBER OF WORKERS

In [42]:
cursor.execute("SELECT COUNT(*) AS Total_Workers FROM sidfirst.workers")

In [43]:
results=cursor.fetchall()
columns = [column[0] for column in cursor.description]
print(tabulate(results,headers = columns,tablefmt = 'pretty'))

+---------------+
| Total_Workers |
+---------------+
|       5       |
+---------------+

In [ ]:
#5. ORDER BY .... USING SELECT with single column hire_date

In [45]:
cursor.execute("SELECT * FROM sidfirst.workers ORDER BY Hire_Date ")

In [46]:
results=cursor.fetchall()
columns = [column[0] for column in cursor.description]
print(tabulate(results,headers = columns,tablefmt = 'pretty'))

+----+---------+----------+--------+------------+
| Id |  Name   | Position | Salary | Hire_Date  |
+----+---------+----------+--------+------------+
| 5  | Harvey  | Manager  | 16000  | 1995-05-20 |
| 3  | charlie |  Senior  |  6000  | 2000-01-12 |
| 4  |  diana  |  Senior  |  7000  | 2000-02-14 |
| 2  |   bob   |  Junior  |  3000  | 2019-05-19 |
| 1  |  Alice  |  Junior  |  2000  | 2020-04-23 |
+----+---------+----------+--------+------------+

In [47]:
cursor.execute("SELECT * FROM sidfirst.workers ORDER BY Position,Salary ") # sorting by 2 columns

In [48]:
results=cursor.fetchall()
columns = [column[0] for column in cursor.description]
print(tabulate(results,headers = columns,tablefmt = 'pretty'))

+----+---------+----------+--------+------------+
| Id |  Name   | Position | Salary | Hire_Date  |
+----+---------+----------+--------+------------+
| 1  |  Alice  |  Junior  |  2000  | 2020-04-23 |
| 2  |   bob   |  Junior  |  3000  | 2019-05-19 |
| 5  | Harvey  | Manager  | 16000  | 1995-05-20 |
| 3  | charlie |  Senior  |  6000  | 2000-01-12 |
| 4  |  diana  |  Senior  |  7000  | 2000-02-14 |
+----+---------+----------+--------+------------+

In [53]:
cursor.execute("SELECT Name,Position,Hire_Date FROM sidfirst.workers ORDER BY Hire_Date, Position Desc ")

In [54]:
results = cursor.fetchall()
columns = [column[0] for column in cursor.description]
print(tabulate(results,headers=columns,tablefmt='pretty'))

+---------+----------+------------+
|  Name   | Position | Hire_Date  |
+---------+----------+------------+
| Harvey  | Manager  | 1995-05-20 |
| charlie |  Senior  | 2000-01-12 |
|  diana  |  Senior  | 2000-02-14 |
|   bob   |  Junior  | 2019-05-19 |
|  Alice  |  Junior  | 2020-04-23 |
+---------+----------+------------+

In [55]:
# 6. LIMIT CLAUSE # gives specific number of records required from result set

In [56]:
cursor.execute("SELECT * FROM sidfirst.workers LIMIT 3 ")

In [57]:
results = cursor.fetchall()
columns = [column[0] for column in cursor.description]
print(tabulate(results,headers=columns,tablefmt='pretty'))

+----+---------+----------+--------+------------+
| Id |  Name   | Position | Salary | Hire_Date  |
+----+---------+----------+--------+------------+
| 1  |  Alice  |  Junior  |  2000  | 2020-04-23 |
| 2  |   bob   |  Junior  |  3000  | 2019-05-19 |
| 3  | charlie |  Senior  |  6000  | 2000-01-12 |
+----+---------+----------+--------+------------+

In [58]:
cursor.execute("SELECT * FROM sidfirst.workers ORDER BY Salary DESC LIMIT 3") # top 3 salary record from highest(descending)

In [59]:
results = cursor.fetchall()
columns = [column[0] for column in cursor.description]
print(tabulate(results,headers=columns,tablefmt='pretty'))

+----+---------+----------+--------+------------+
| Id |  Name   | Position | Salary | Hire_Date  |
+----+---------+----------+--------+------------+
| 5  | Harvey  | Manager  | 16000  | 1995-05-20 |
| 4  |  diana  |  Senior  |  7000  | 2000-02-14 |
| 3  | charlie |  Senior  |  6000  | 2000-01-12 |
+----+---------+----------+--------+------------+

In [62]:
cursor.execute("SELECT * FROM sidfirst.workers ORDER BY id LIMIT 2 OFFSET 2 ;")

In [63]:
results = cursor.fetchall()
columns = [column[0] for column in cursor.description]
print(tabulate(results,headers=columns,tablefmt='pretty'))

+----+---------+----------+--------+------------+
| Id |  Name   | Position | Salary | Hire_Date  |
+----+---------+----------+--------+------------+
| 3  | charlie |  Senior  |  6000  | 2000-01-12 |
| 4  |  diana  |  Senior  |  7000  | 2000-02-14 |
+----+---------+----------+--------+------------+